In [11]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\memer\onedrive\documentos\eme\universidad\2025-1\etl\workshopone\workshopone\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\memer\onedrive\documentos\eme\universidad\2025-1\etl\workshopone\workshopone\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\memer\onedrive\documentos\eme\universidad\2025-1\etl\workshopone\workshopone\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\memer\onedrive\documentos\eme\universidad\2025-1\etl\workshopone\workshopone\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\memer\onedrive\documentos\eme\universidad\2025-1\etl\workshopone\workshopone\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\memer\onedrive\documentos\eme\universidad\2025-1\etl\workshopone\workshopone\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 23.2.1 -> 25.0.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [21]:
import pandas as pd
df = pd.read_csv("C:/Users/memer/OneDrive/Documentos/Eme/UNIVERSIDAD/2025-1/ETL/WorkshopOne/candidates.csv", sep=";")
df.head()

,First Name,Last Name,Email,Application Date,Country,YOE,Seniority,Technology,Code Challenge Score,Technical Interview Score
0,Bernadette,Langworth,leonard91@yahoo.com,2021-02-26,Norway,2,Intern,Data Engineer,3,3
1,Camryn,Reynolds,zelda56@hotmail.com,2021-09-09,Panama,10,Intern,Data Engineer,2,10
2,Larue,Spinka,okey_schultz41@gmail.com,2020-04-14,Belarus,4,Mid-Level,Client Success,10,9
3,Arch,Spinka,elvera_kulas@yahoo.com,2020-10-01,Eritrea,25,Trainee,QA Manual,7,1
4,Larue,Altenwerth,minnie.gislason@gmail.com,2020-05-20,Myanmar,13,Mid-Level,Social Media Community Management,9,7

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50000 entries, 0 to 49999
Data columns (total 10 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   First Name                 50000 non-null  object
 1   Last Name                  50000 non-null  object
 2   Email                      50000 non-null  object
 3   Application Date           50000 non-null  object
 4   Country                    50000 non-null  object
 5   YOE                        50000 non-null  int64
 6   Seniority                  50000 non-null  object
 7   Technology                 50000 non-null  object
 8   Code Challenge Score       50000 non-null  int64
 9   Technical Interview Score  50000 non-null  int64
dtypes: int64(3), object(7)
memory usage: 3.8+ MB

In [24]:
df.describe()

                YOE  Code Challenge Score  Technical Interview Score
count  50000.000000          50000.000000               50000.000000
mean      15.286980              4.996400                   5.003880
std        8.830652              3.166896                   3.165082
min        0.000000              0.000000                   0.000000
25%        8.000000              2.000000                   2.000000
50%       15.000000              5.000000                   5.000000
75%       23.000000              8.000000                   8.000000
max       30.000000             10.000000                  10.000000

In [25]:
df.isnull().sum()

First Name                   0
Last Name                    0
Email                        0
Application Date             0
Country                      0
YOE                          0
Seniority                    0
Technology                   0
Code Challenge Score         0
Technical Interview Score    0
dtype: int64

In [26]:
df.duplicated().sum()

np.int64(0)

In [29]:
print(df.columns.tolist())

['First Name', 'Last Name', 'Email', 'Application Date', 'Country', 'YOE', 'Seniority', 'Technology', 'Code Challenge Score', 'Technical Interview Score']

In [30]:
import numpy as np

df["hired"] = np.where((df["Code Challenge Score"] >= 7) & (df["Technical Interview Score"] >= 7), True, False)